[
    {
        "version": "3.1.1",
        "date": "2023-06-23",
        "changes": {
            "new": [
                "This is the first fully open-source version, where all the code and releases are published in the open on GitHub."
            ]
        }
    },
    {
        "version": "3.1.0",
        "date": "2023-06-08",
        "changes": [
            {
                "new": [
                    "Custom browser's profiles are now just custom browsers, making custom-registered browser experience more ergonomic. They can be added from File menu.",
                    "Metrics window is completely removed. I've decided this app should do one thing but do it well and metrics is just outside of the scope of Browser Tamer core functionality. There are plenty of tools to investigate performance, including ones built into Windows itself.",
                    "File menu has new option - 'copy path to config.ini' which copies it to clipboard."
                ],
                "improvements": [
                    "Browser list in config window is sorted - system browsers alphabetically, then custom browsers alphabetically. Profiles are sorted alphabetically to, incognito being at the end. All of the sorting is case-insensitive.",
                    "Freed up configuration real estate by moving 'test' button to the rest of browser control buttons.",
                    "Window scaling errors fixed for certain monitors.",
                    "Config window status bar text doesn't jump around when width change.",
                    "All of the browsers have a running icon indicator, including user-defined."
                ],
                "bugs": [
                    "If custom defined browser didn't specify url argument nothing was passed to the target browser"
                ]
            }

        ]
    },
    {
        "version": "3.0.2",
        "date": "2023-05-26",
        "changes": [
            {
                "new": [
                    "License terms updated so that you don't have to buy me a cake (including vanilla) or assign your first-born child. You are obliged to buy me a coffee though, which is cheaper than cake."
                ],
                "bugs": [
                    "CPU usage metric is unreliable and is temporarily removed."
                ]
            }

        ]
    },
    {
        "version": "3.0.1",
        "date": "2023-05-23",
        "changes": [
            {
                "new": [
                    "Status bar displays current CPU load of your system.",
                    "Metrics window is available from browser right panel, showing realtime graphs of CPU, Memory and number of processes of the browser in general."
                ]
            }

        ]
    },
    {
        "version": "3.0.0",
        "date": "2023-05-09",
        "changes": [
            {
                "new": [
                    "Browser discovery is only triggered by user request, so we don't re-discover on every launch. It makes antivirus software more happy",
                    "All the browser metadata is saved inside the .ini file",
                    "Configuration file location is now at LocalAppData\\bt\\config.ini",
                    "Installers are now .msi based",
                    "Show notification when link is intercepted (off by default)"
                ],
                "improvements": [
                    "URL Tester shows additional column with browser and profile."
                ]
            }

        ]
    },
    {
        "version": "2.9.14",
        "date": "2023-05-02",
        "changes": [
            {
                "new": [
                    "Added a button to kill all browser processes"
                ],
                "improvements": [
                    "update to latest release of ImGui and MSVC++"
                ]
            }

        ]
    },
    {
        "version": "2.9.13",
        "date": "2023-03-27",
        "changes": [
            {
                "improvements": [
                    "New version check on start"
                ],
                "bugs": [
                    "Fixed configuration window shake when dragging."
                ]
            }

        ]
    },
    {
        "version": "2.9.12",
        "date": "2023-03-13",
        "changes": [
            {
                "new": [
                    "In addition to appearing on hot key press, Picker supports three modes. Silent - never pop up. Conflict - pop up if there are multiple matches (current and default mode). Always - always pop up regardless of any conditions."
                ],
                "improvements": [
                    "Autoshutdown is now off by default by popular demands."
                ],
                "bugs": [
                    "Corporate Grey theme was always turning on Cherry."
                ]
            }

        ]
    },
    {
        "version": "2.9.11",
        "date": "2023-02-24",
        "changes": [
            {
                "improvements": [
                    "RAM usage and process count now also display microplots."
                ],
                "bugs": [
                    "Only allow single instance of the configuration dialog."
                ]
            }

        ]
    },
    {
        "version": "2.9.10",
        "date": "2023-02-23",
        "changes": [
            {
                "bugs": [
                    "Autoshutdown was invoked in 2 minutes instead of 30.",
                    "I didn't have coffee like everyone else did."
                ]
            }

        ]
    },
    {
        "version": "2.9.9",
        "date": "2023-02-23",
        "changes": [
            {
                "bugs": [
                    "There were a lot of visually identical notification icons in Windows tasbar history due to re-registering a new one on startup."
                ]
            }

        ]
    },
    {
        "version": "2.9.8",
        "date": "2023-02-14",
        "changes": [
            {
                "new": [
                    "BT will automatically shut-down if not used for 30 minutes to consume even less resources. You can disable that in settings, but I'm not sure why you would do that'."
                ],
                "improvements": [
                    "Browser uptime is displayed as a part of browser stats",
                    "Browser profile overlays in the picker are rounded similar to how Chromium paints them.",
                    "Multi-window interface"
                ],
                "bugs": [
                    "Change Log was trimming older entries so you couldn't see them at all.",
                    "Picker Enabled setting was always ignored and picker was shown regardless",
                    "Uninstaller completely removes all traces of BT from the system"
                ]
            }

        ]
    },
    {
        "version": "2.9.7",
        "date": "2022-12-14",
        "changes": [
            {
                "improvements": [
                    "PDF association has a different icon"
                ]
            }

        ]
    },
    {
        "version": "2.9.6",
        "date": "2022-12-14",
        "changes": [
            {
                "new": [
                    "Brave Browser profiles are fully supported",
                    "Brave Tor Mode is supported. Unfortunately due to the bug in Brave itself it opens duplicate instances for Tor URL. This shoudl be fixed in Brave soon.",
                    "BT registers itself as a handler for popular file extensions browsers can handle (pdf, html, html, svg etc.). If you already have BT installed, go to Tools->Troubleshooting->Re-register as Browser to enable this."
                ],
                "improvements": [
                    "More modern looking installer (if you are using it)",
                    "Menu look more aligned to icons"
                ]
            }

        ]
    },
    {
        "version": "2.9.5",
        "date": "2022-12-13",
        "changes": [
            {
                "improvements": [
                    "windows and controls have rounded corners",
                    "selection rectangles change backgrounds",
                    "picker has proper spacing",
                    "picker window has title and close button"
                ]
            }

        ]
    },
    {
        "version": "2.9.4",
        "date": "2022-12-12",
        "changes": [
            {
                "bugs": [
                    "change log window could not be closed by X button",
                    "URLs containing exclamation mark were trimmed"
                ],
                "improvements": [
                    "URL tester window is not modal and looks slightly better"
                ]
            }

        ]
    },
    {
        "version": "2.9.3",
        "date": "2022-12-08",
        "changes": [
            {
                "new": [
                    "completely redesigned URL picker - more modern, scrollable and adjustable",
                    "URL picker now allows to copy URL to clipboard and cancel"
                ]
            }

        ]
    },
    {
        "version": "2.9.2",
        "date": "2022-12-08",
        "changes": [
            {
                "bugs": [
                    "picker was always triggered"
                ]
            }

        ]
    },
    {
        "version": "2.9.1",
        "date": "2022-12-08",
        "changes": [
            {
                "bugs": [
                    "picker was not triggered at all"
                ]
            }

        ]
    },
    {
        "version": "2.9.0",
        "date": "2022-12-07",
        "changes": [
            {
                "new": [
                    "more modern user interface layout",
                    "custom browser location is now selectable with standard Windows file dialog instead of manual input",
                    "tools->rediscover browsers menu item rescans your OS for browser changes instantly",
                    "number of processes and amount of RAM used is displayed next to browser item",
                    "file menu has a new option to open bt.ini configuration file",
                    "almost zero tracking: I only record the fact the app is started, and the app version, nothing else."
                ],
                "improvements": [
                    "Chromium profile discovery is now much faster and much more secure",
                    "browser rules visual editor replaces multiline textbox - this is to get ready for more complicated rules",
                    "small pedantic UI improvements"
                ]
            }

        ]
    },
    {
        "version": "2.8.7",
        "date": "2022-11-24",
        "changes": [
            {
                "new": [
                    "BT follows OS application mode (Windows 10 & Windows 11) for theming. Light and Dark mode are supported. You can additionally pin theme in settings, as well as choose a theme other than Light and Dark."
                ]
            }

        ]
    },
    {
        "version": "2.8.6",
        "date": "2022-11-21",
        "changes": [
            {
                "improvements": [
                    "Firefox profile discovery has changed - instead of trying to enumerate profile folders in AppData/Local BT now reads profiles.ini which is way more reliable.",
                    "New button in BT UI allows to open Firefox profile manager in a system window or inside the Firefox itself."
                ]
            }

        ]
    },
    {
        "version": "2.8.5",
        "date": "2022-11-21",
        "changes": [
            {
                "bugs": [
                    "UI is more responsive (was trying to be as effective as possible too much).",
                    "hot key detection fixed, hopefully forever!"
                ],
                "improvements": [
                    "UI shows which hot keys are pressed down at the moment",
                    "change log can be viewer from the website as well as the app itself"
                ]
            }

        ]
    },
    {
        "version": "2.8.3",
        "date": "2022-11-18",
        "changes": [
            {
                "bugs": [
                    "shutdown was opening a new instance instead of actually shutting down"
                ],
                "improvements": [
                    "Chromium profile discovery is now much faster and more secure",
                    "change log is now embedded into BT program itself. The website won't show it.",
                    "very minor UI polishes."
                ]
            }

        ]
    },
    {
        "version": "2.8.2",
        "date": "2022-11-17",
        "changes": [
            {
                "improvements": [
                    "notification icon displays tooltip with version number",
                    "BT is now rendering UI in high resolution, the difference is immense!",
                    "picker hot keys are customizable."
                ]
            }

        ]
    },
    {
        "version": "2.8.1",
        "date": "2022-11-16",
        "changes": [
            {
                "bugs": [
                    "detection for x-bt protocol was sometimes showing BT is not registered as a handler.",
                    "picker hot key detection was often wrongly thiking picker should be called."
                ]
            }

        ]
    },
    {
        "version": "2.8.0",
        "date": "2022-11-10",
        "changes": [
            {
                "new": [
                    "Fully support Firefox Profiles."
                ]
            }

        ]
    },
    {
        "version": "2.7.9",
        "date": "2022-11-02",
        "changes": [
            {
                "new": [
                    "Vivaldi brower profiles are supported."
                ]
            }

        ]
    },
    {
        "version": "2.7.7",
        "date": "2022-10-05",
        "changes": [
            {
                "improvements": [
                    "bt.exe now runs in \"efficiency mode\" which makes it absolutely non existant in terms of system resource usage."
                ],
                "bugs": [
                    "occasional crash on urls with \"%\"."
                ]
            }

        ]
    },
    {
        "version": "2.7.6",
        "date": "2022-09-26",
        "changes": [
            {
                "improvements": [
                    "window header displays version.",
                    "by popular requests more items added to context menu."
                ],
                "bugs": [
                    "pressing \"exit\" in config window did nothing."
                ]
            }

        ]
    },
    {
        "version": "2.7.5",
        "date": "2022-09-21",
        "changes": [
            {
                "improvements": [
                    "Installer does not require admin privileges to install anymore."
                ]
            }

        ]
    },
    {
        "version": "2.7.4",
        "date": "2022-09-20",
        "changes": [
            {
                "bugs": [
                    "search queries issued by \"PowerToys Run\" (starting with ?) were launching new instance of BT rather than launching search."
                ]
            }

        ]
    },
    {
        "version": "2.7.3",
        "date": "2022-09-20",
        "changes": [
            {
                "bugs": [
                    "installer is now putting files into user profile instead of installing machine-wide. You might need to uninstall 2.7.2 manually."
                ]
            }

        ]
    },
    {
        "version": "2.7.2",
        "date": "2022-09-19",
        "changes": [
            {
                "improvements": [
                    "added proper Windows application metadata to the output .exe",
                    "configuration is now stored alongside .exe in bt.ini file and can be moved around. Windows Registry is not used at all."
                ]
            }

        ]
    },
    {
        "version": "2.7.1",
        "date": "2022-09-14",
        "changes": [
            {
                "improvements": [
                    "general stability"
                ]
            }

        ]
    },
    {
        "version": "2.7.0",
        "date": "2022-09-13",
        "changes": [
            {
                "new": [
                    "added system notification icon - click to open configuration, right-click for more options. Bug fixed: Sometimes URL picker will show only when “ctrl” is pressed. System improvements: using windows messaging instead of named pipes which would trigger antivirus false positive sometimes. Also executable size is now even smaller."
                ]
            }

        ]
    },
    {
        "version": "2.6.2",
        "date": "2022-07-06",
        "changes": [
            {
                "new": [
                    "Added ability to delete custom profiles. Installer now shuts down bt.exe before upgrading to avoid conflicts."
                ]
            }

        ]
    },
    {
        "version": "2.6.1",
        "date": "2022-07-04",
        "changes": [
            {
                "new": [
                    "redesigned user interface in the configuration editor",
                    "browser picker displays icons graphically and sorts them based on frequency of use",
                    "if there is more than one rule match in different browsers, UI will ask which one you want instead of using the first one"
                ],
                "improvements": [
                    "even thought there are more features in this release, it’s considerably smaller in size and faster."
                ]
            }

        ]
    },
    {
        "version": "2.5.6",
        "date": "2022-06-13",
        "changes": [
            {
                "improvements": [
                    "Performance and security"
                ]
            }

        ]
    },
    {
        "version": "2.5.5",
        "date": "2022-05-20",
        "changes": [
            {
                "improvements": [
                    "Performance and security"
                ]
            }

        ]
    },
    {
        "version": "2.5.4",
        "date": "2022-05-12",
        "changes": [
            {
                "improvements": [
                    "Performance and security"
                ]
            }

        ]
    },
    {
        "version": "2.5.3",
        "date": "2022-03-21",
        "changes": [
            {
                "improvements": [
                    "added auto update check and link to Chrome extension"
                ]
            }

        ]
    },
    {
        "version": "2.5.2",
        "date": "2022-03-18",
        "changes": [
            {
                "bugs": [
                    "URL picker would sometimes hang in the background."
                ]
            }

        ]
    },
    {
        "version": "2.5.1",
        "date": "2022-03-16",
        "changes": [
            {
                "bugs": [
                    "URL picker was opening in the background so you couldn’t see it sometimes."
                ]
            }

        ]
    },
    {
        "version": "2.5",
        "date": "2022-03-15",
        "changes": [
            {
                "new": [
                    "add your own browser",
                    "support for Firefox private mode",
                    "support for x-bt protocol"
                ],
                "improvements": [
                    "picker launcher keys can be configured!",
                    "user interface is slightly more polished."
                ]
            }

        ]
    },
    {
        "version": "2.4",
        "date": "2022-02-11",
        "changes": [
            {
                "new": [
                    "When holding ctrl and pressing a link, you can pick which browser to open."
                ]
            }

        ]
    },
    {
        "version": "2.3",
        "date": "2022-01-20",
        "changes": [
            {
                "improvements": [
                    "Performance and security"
                ]
            }

        ]
    },
    {
        "version": "2.2",
        "date": "2022-01-16",
        "changes": [
            {
                "improvements": [
                    "Performance and security"
                ]
            }

        ]
    },
    {
        "version": "2.1",
        "date": "2021-11-16",
        "changes": [
            {
                "improvements": [
                    "Still called Oh Dear! due to the fact I love ImGui so much."
                ]
            }

        ]
    },
    {
        "version": "2.0",
        "date": "2021-11-13",
        "changes": [
            {
                "new": [
                    "Complete UI rewrite and new features. Due to the fact Microsoft cannot decide on what is the UI framework for programming on Windows, I’ve decided to use a completely independent third-party framework ImGui which is usually used in game development but also good for small utilities like this. It’s super small and super fast."
                ]
            }

        ]
    },
    {
        "version": "1.0",
        "date": "2021-09-06",
        "changes": [
            {
                "new": [
                    "Sort of a first release."
                ]
            }

        ]
    }
]